from bwt import *
# выполнить прямое и обратное преобразования 3 отдельных блоков данных, состоящих: 
# а) из собственного имени (можно краткий вариант записи); 
# б) собственной фамилии; 
# в) самообороноспособность
# Выполнить качественный сравнительный анализ длительности процессов прямого и обратного преобразований в зависимости от длины блока данных. 
# Перевести первые 3 символа из блока данных, указанного вварианте таблицы, в бинарную последовательность в соответствии с кодами ASCII. 
# Выполнить прямое и обратное преобразование. 
# Оценить время прямого и обратного преобразований.

task('вера')
task('пригодич')
task('самообороноспособность')
task(text_to_bits('sam'))