# 2. С помощью приложения выполнить прямое и обратное преобразования сообщений в соответствии с таблицей
# вариант 8
# самообороноспособность
# самообороноспособностьмалосимпатичный
# 3. Дать оценку возможности переполнения при выполнении вычислений. 
# 4. Сравнить характеристики арифметического сжатия с вероятностными алгоритмами. 
from probabilities import *
from arithmetic import *


seq = 'самообороноспособность'
print('\n\n',seq)
task(seq)

seq = 'самообороноспособностьмалосимпатичный'
print('\n\n', seq)
task(seq)